# Вычислить число c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001
import math

d = len((input("Введите число: ")).split(".")[1])

formatted_PI = int(math.pi * 10 ** d) / 10 ** d

print(f"d = {d}, π = {formatted_PI}")
